yosys read_verilog -noopt -nolatches -sv foo/work_bar/protocol.sv;
yosys hierarchy -auto-top;
yosys hierarchy -libdir foo/work_bar;
yosys hierarchy -check;
yosys rename -top main;
yosys delete -output main;
yosys expose main/prop_neg;
yosys proc;
yosys clean;
yosys splitnets -driver;
yosys clean;
yosys pmuxtree;
yosys clean;
yosys memory;
yosys clean;
yosys flatten;
yosys clean -purge;
yosys setundef -undriven -expose -undef;
yosys clean;
yosys check;
yosys write_ilang foo/work_bar/bar.ilang;
yosys write_verilog -attr2comment foo/work_bar/bar_y.v;
yosys write_btor foo/work_bar/bar.btor2;
