
        read_verilog -formal protocol.sv
        prep -top system
        flatten
        memory -nordff
        setundef -undriven -init -expose
        delete -output
        techmap
        abc -fast -g AND
        write_aiger  protocol.aig
        