# running in v/src/
    read -sv protocol.sv
    prep -top system

hierarchy -simcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
