
        read_verilog -formal protocol.sv
        prep -top system
        flatten
        memory -nordff

        aigmap
        abc -fast -g AND
        write_aiger -zinit  protocol.aiger
        