# running in v2/src/
    read -sv protocol.sv
    prep -top system

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
